# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [1]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

In [2]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [9]:
%%sql
CREATE TABLE IF NOT EXISTS test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [5]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [10]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2017, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2017, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [12]:
%sql DROP TABLE IF EXISTS test_table

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [6]:
%%sql
DROP TABLE IF EXISTS dimDate;
DROP TABLE IF EXISTS dimCustomer;
DROP TABLE IF EXISTS dimStore;
DROP TABLE IF EXISTS dimMovie;
DROP TABLE IF EXISTS factSales;

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.
Done.
Done.
Done.
Done.

[]

In [7]:
%%sql CREATE TABLE IF NOT EXISTS dimDate
(
    date_key SERIAL PRIMARY KEY NOT NULL UNIQUE,
    date DATE,
    year SMALLINT, 
    quarter SMALLINT,
    month SMALLINT, 
    day SMALLINT,
    week SMALLINT,
    is_weekend BOOLEAN
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [8]:
%%sql 
select * from dimDate limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
0 rows affected.

[]

In [9]:
%%sql
CREATE TABLE IF NOT EXISTS dimCustomer
(
  customer_key SERIAL PRIMARY KEY UNIQUE NOT NULL,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);

CREATE TABLE IF NOT EXISTS dimMovie
(
  movie_key          SERIAL PRIMARY KEY UNIQUE NOT NULL,
  film_id            smallint NOT NULL,
  title              varchar(255) NOT NULL,
  description        text,
  release_year       year,
  language           varchar(20) NOT NULL,
  original_language  varchar(20),
  rental_duration    smallint NOT NULL,
  length             smallint NOT NULL,
  rating             varchar(5) NOT NULL,
  special_features   varchar(60) NOT NULL
);
CREATE TABLE IF NOT EXISTS dimStore
(
  store_key           SERIAL PRIMARY KEY UNIQUE NOT NULL,
  store_id            smallint NOT NULL,
  address             varchar(50) NOT NULL,
  address2            varchar(50),
  district            varchar(20) NOT NULL,
  city                varchar(50) NOT NULL,
  country             varchar(50) NOT NULL,
  postal_code         varchar(10),
  manager_first_name  varchar(45) NOT NULL,
  manager_last_name   varchar(45) NOT NULL,
  start_date          date NOT NULL,
  end_date            date NOT NULL
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.
Done.
Done.

[]

In [10]:
%%sql
CREATE TABLE IF NOT EXISTS factSales
(
    sales_key SERIAL PRIMARY KEY UNIQUE NOT NULL,
    date_key INTEGER REFERENCES dimDate (date_key),
    customer_key INTEGER REFERENCES dimCustomer (customer_key),
    movie_key INTEGER REFERENCES dimMovie (movie_key),
    store_key INTEGER REFERENCES dimStore (store_key),
    sales_amount NUMERIC
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

In [11]:
%%sql
SELECT * from payment limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [12]:
%%sql
SELECT * from store limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, 1, datetime.datetime(2017, 2, 15, 9, 57, 12, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (2, 2, 2, datetime.datetime(2017, 2, 15, 9, 57, 12, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [13]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [21]:
%%sql
select count(*) from dimDate;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(40,)]

In [14]:
%%sql
select * from dimDate LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(20170407, datetime.date(2017, 4, 7), 2017, 2, 4, 7, 14, False),
 (20170130, datetime.date(2017, 1, 30), 2017, 1, 1, 30, 5, False),
 (20170318, datetime.date(2017, 3, 18), 2017, 1, 3, 18, 11, True),
 (20170426, datetime.date(2017, 4, 26), 2017, 2, 4, 26, 17, False),
 (20170215, datetime.date(2017, 2, 15), 2017, 1, 2, 15, 7, False)]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [15]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT  c.customer_id AS customer_key,
        c.customer_id AS customer_id,
        c.first_name AS first_name,
        c.last_name AS last_name,
        c.email AS email,
        a.address AS address,
        a.address2 AS address2,
        a.district AS district,
        ci.city AS CITY,
        co.country AS country,
        a.postal_code AS postal_code,
        a.phone AS phone,
        c.active AS active,
        c.create_date AS create_date,
        now()         AS start_date,
        now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

In [20]:
%%sql
select count(*) from dimCustomer;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(599,)]

In [19]:
%%sql
select * from dimCustomer limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 7, 12), datetime.date(2020, 7, 12)),
 (2, 2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 7, 12), datetime.date(2020, 7, 12)),
 (3, 3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 7, 12), datetime.date(2020, 7, 12)),
 (4, 4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 7, 12), datetime.date(2020, 7, 12)),
 (5, 5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 7, 12), datetime.date(2020, 7, 12))]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [17]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language,
  rental_duration, length, rating, special_features)
SELECT  f.film_id AS movie_key,
        f.film_id AS film_id,
        f.title AS title,
        f.description AS description,
        f.release_year AS release_year,
        l.name AS language,
        orig_lang.name AS original_language,
        f.rental_duration AS rental_duration, 
        f.length AS length, 
        f.rating AS rating, 
        f.special_features AS special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

In [22]:
%%sql
select count(*) from dimMovie;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1000,)]

In [18]:
%%sql
select * from dimMovie limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 'English', None, 6, 86, 'PG', '{"Deleted Scenes","Behind the Scenes"}'),
 (2, 2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 'English', None, 3, 48, 'G', '{Trailers,"Deleted Scenes"}'),
 (3, 3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 'English', None, 7, 50, 'NC-17', '{Trailers,"Deleted Scenes"}'),
 (4, 4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 'English', None, 5, 117, 'G', '{Commentaries,"Behind the Scenes"}'),
 (5, 5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 'English', None, 6, 130, 'G', '{"Deleted Scenes"}')]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [24]:
%%sql
INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code,
                      manager_first_name, manager_last_name, start_date, end_date)
SELECT  s.store_id AS store_key,
        s.store_id AS store_id,
        a.address AS address,
        a.address2 AS address2,
        a.district AS district,
        ci.city AS city,
        co.country AS country,
        a.postal_code AS postal_code,
        st.first_name AS manager_first_name,
        st.last_name AS manager_last_name,
        now() AS start_date,
        now() AS end_date
FROM store s
JOIN staff st ON (s.manager_staff_id = st.staff_id)
JOIN address a ON (s.address_id = a.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id)

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

In [25]:
%%sql
select count(*) from dimStore;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(2,)]

In [26]:
%%sql
SELECT * FROM dimStore LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2020, 7, 12), datetime.date(2020, 7, 12)),
 (2, 2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.date(2020, 7, 12), datetime.date(2020, 7, 12))]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [28]:
%%sql
INSERT INTO factSales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT 
TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,
p.customer_id AS customer_key,
i.film_id AS movie_key,
i.store_id AS store_key,
p.amount AS sales_amount

FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i  ON (r.inventory_id = i.inventory_id)

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

In [29]:
%%sql
select count(*) from factSales;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(16049,)]

In [34]:
%%sql
select * FROM factSales ORDER BY sales_amount DESC, date_key DESC LIMIT 20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.

[(13087, 20170429, 13, 771, 1, Decimal('11.99')),
 (12750, 20170407, 591, 580, 2, Decimal('11.99')),
 (12765, 20170406, 592, 575, 2, Decimal('11.99')),
 (8504, 20170323, 195, 771, 2, Decimal('11.99')),
 (6601, 20170322, 204, 908, 1, Decimal('11.99')),
 (7708, 20170321, 116, 324, 1, Decimal('11.99')),
 (4354, 20170321, 362, 846, 2, Decimal('11.99')),
 (8817, 20170302, 237, 889, 1, Decimal('11.99')),
 (1305, 20170217, 305, 946, 2, Decimal('11.99')),
 (1006, 20170125, 196, 791, 2, Decimal('11.99')),
 (11181, 20170430, 448, 444, 2, Decimal('10.99')),
 (10934, 20170430, 426, 551, 1, Decimal('10.99')),
 (12880, 20170430, 203, 897, 1, Decimal('10.99')),
 (9872, 20170430, 333, 324, 1, Decimal('10.99')),
 (12823, 20170430, 595, 580, 2, Decimal('10.99')),
 (12538, 20170430, 573, 764, 2, Decimal('10.99')),
 (10422, 20170430, 380, 764, 1, Decimal('10.99')),
 (9158, 20170430, 272, 778, 1, Decimal('10.99')),
 (11097, 20170430, 441, 1000, 1, Decimal('10.99')),
 (12965, 20170430, 2, 878, 2, Decimal('10.99'))]